app/Http/Controllers/HistoryController.php

select distinct `exercise_date` from `histories` where `user_id` = 1 and `exercise_date` between '2023-07-01' and '2023-09-30'
---
        $startDate = (new \DateTime($year . "-" . $prevMonth . "-1"))->format('Y-m-01');
        $endDate = (new \DateTime($year . "-" . $nextMonth . "-1"))->format('Y-m-t');

        $exerciseDates = DB::table('histories')
            ->select('exercise_date')
            ->where('user_id', Auth::id())
            ->whereBetween('exercise_date', [$startDate, $endDate])
            ->distinct()
            ->pluck('exercise_date')
            ->map(function ($date) {
                return [
                    'year' => intval(date('Y', strtotime($date))),
                    'month' => intval(date('m', strtotime($date))),
                    'day' => intval(date('d', strtotime($date)))
                ];
            })
            ->toArray();

select * from `histories` where `exercise_date` = '2023-8-9'
select * from `histories` where `exercise_date` = '2023-8-9' limit 1
---
    public function showHistory($date)
    {
        $history = DB::table('histories')
            ->where('exercise_date', $date)
            ->get();
        $menu_name = History::where('exercise_date', $date)->first()->menu_name;