app/Http/Controllers/ScheduleController.php

    public function schedule_index()
    {
        $menus = Menu::where('user_id', Auth::id())->orderBy('order')->get();
        $menuExists = Menu::where('user_id', Auth::id())->count() > 0;
        $exercises = Exercises::all()->groupBy('body_part');
        $body_parts = Exercises::select('body_part')->distinct()->get()->pluck('body_part');
---
select * from `menus` where `user_id` = 1 order by `order` asc
select count(*) as aggregate from `menus` where `user_id` = 1
select * from `exercises`
select distinct `body_part` from `exercises`

    public function scheduleUpdate(S_UpdateRequest $request, string $id)
    {

        $menu = Menu::findOrFail($id);
---
select * from `menus` where `menus`.`id` = '3' limit 1

            function ($id) {
                return $id !== 'new';
            }
        );

        // データベースから現在のメニューに関連する全てのメニューエクササイズを取得し、それらが上記の配列に存在しない場合、それらを削除
        MenuExercise::where('menu_id', $id)->whereNotIn('id', $menuExerciseIds)->delete();

        // 以下は既存のコードを維持
        foreach ($request->menu_exercises as $menuExerciseData) {
            if (isset($menuExerciseData['id']) && $menuExerciseData['id'] != 'new') {
                // Existing menu exercise update
                $menuExercise = MenuExercise::find($menuExerciseData['id']);
---
delete from `menu_exercises` where `menu_id` = '3' and `id` not in ('5', '7', '8', '9', '10', '11', '12')
select * from `menu_exercises` where `menu_exercises`.`id` = '5' limit 1

    public function schedule_Edit(string $id)
    {
        //
        $menu = Menu::find($id);;
        $exercises = Exercises::all()->groupBy('body_part');
---
select * from `menus` where `menus`.`id` = '3' limit 1
select * from `exercises`

    public function menuDelete(Request $request)
    {

        Menu::destroy($request->menuId);
        // メニューが全て削除されたかを確認
        if (Menu::count() == 0) {
---
delete from `menus` where `id` = 5
select count(*) as aggregate from `menus`

    public function addMenu(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'selectedExercises' => 'required|array|min:1',
        ], [], [
            'selectedExercises' => '選択されたエクササイズ',
        ]);
        if ($validator->fails()) {
            return redirect()->back()->withErrors($validator)->with('showModal', 'true');
        }
        $menu = new Menu(); // 新しいMenuインスタンスを作成します

        $menu->user_id = Auth::id();  // ユーザーIDを認証済みユーザーのIDで設定します
        $menu->name = $request->menu_name;        // メニューの名前をリクエストから取得します

        // 新しいメニューを挿入する位置を取得 もしリクエストに位置が指定されていなければ、ユーザーの既存のメニューの数+1を使用します
        $insertPosition = $request->insert_position ? intval($request->insert_position) + 1 : Menu::where('user_id', Auth::id())->count() + 1;

        $menusToUpdate = Menu::where('user_id', Auth::id()) // 挿入位置以降のすべてのメニューを取得します
            ->where('order', '>=', $insertPosition)
            ->get();
        foreach ($menusToUpdate as $menuToUpdate) {     // 影響を受けるメニューの順序を更新します
            $menuToUpdate->order++;
            $menuToUpdate->save();
        }

        $menu->order = $insertPosition; // 新しいメニューの順序を設定し、それを保存します
        $menu->save();
---
select * from `menus` where `user_id` = 1 and `order` >= 2
insert into `menus` (`user_id`, `name`, `order`, `updated_at`, `created_at`) values (1, 'qqq', 2, '2023-08-11 21:15:47', '2023-08-11 21:15:47')

                $menu_exercise->menu_id = $menu->id;
                $menu_exercise->exercise_id = $exerciseId;
                $menu_exercise->set = 1;
                $menu_exercise->save();
---
insert into `menu_exercises` (`menu_id`, `exercise_id`, `set`, `updated_at`, `created_at`) values (5, '8', 1, '2023-08-11 21:15:47', '2023-08-11 21:15:47')

    public function scheduleAddExercise(Request $request) //スケジュール編集画面の種目追加
    {
        $validator = Validator::make($request->all(), [
            'selectedExercises' => 'required|array|min:1',
        ]);

        if ($validator->fails()) {
            return redirect()->back()->withErrors($validator)->with('showModal', 'true');
        }
        // Get the request data
        $exerciseIds = $request->input('selectedExercises');
        $menuId = $request->input('menu_id');

        // Retrieve the specific Menu
        $menu = Menu::find($menuId);
        $currentExercisesCount = $menu->exercises()->count();
        // Save the data
        foreach ($exerciseIds as $exerciseId) {
            $menu->exercises()->attach($exerciseId, ['set' => 1, 'index' => $currentExercisesCount]);
---
select * from `menus` where `menus`.`id` = '3' limit 1
select count(*) as aggregate from `exercises` inner join `menu_exercises` on `exercises`.`id` = `menu_exercises`.`exercise_id` where `menu_exercises`.`menu_id` = 3
insert into `menu_exercises` (`exercise_id`, `index`, `menu_id`, `set`) values ('19', 1, 3, 1)

    public function addNewExercise(ScheduleRequest $request)

    {

        // すでに存在する名前かどうかをチェック
        $existingExercise = Exercises::where('name', $request->exercise_name)->first();
        if ($existingExercise) {
            return response()->json([
                'status' => 'error',
                'message' => 'この名前の種目はすでに登録されています。'
            ], 400); // 400 Bad Requestを返す
        }
        //exerciseテーブルにデータを保存
        $exercise = new Exercises();
        $exercise->name = $request->exercise_name;

        // ユーザーが新しい部位を追加した場合、それを使用
        if (!empty($request->new_body_part)) {
            $exercise->body_part = $request->new_body_part;

            // 新しい部位を部位テーブルに保存
        } else {
            // そうでなければ、選択された既存の部位を使用
            $exercise->body_part = $request->body_part;
        }

        $exercise->save();
---
select * from `exercises` where `name` = '12' limit 1
insert into `exercises` (`name`, `body_part`, `updated_at`, `created_at`) values ('12', '腕', '2023-08-11 21:14:41', '2023-08-11 21:14:41')

    public function updateMenuOrder(Request $request)
    {
        $order = $request->input('order');

        foreach ($order as $id => $newOrder) {
            $menu = Menu::find($id);
            if ($menu) {
                $menu->order = $newOrder;
                $menu->save();
---
select * from `menus` where `menus`.`id` = 4 limit 1
update `menus` set `order` = '2', `menus`.`updated_at` = '2023-08-11 21:16:01' where `id` = 4