app/Http/Controllers/TodayMenusController.php

    public function todayMenu()
    {
        $user_id = Auth::id();
        $user = User::find($user_id);

        // Find the next menu
        $menu = Menu::where('user_id', $user_id)
            ->where('order', '>', $user->last_finish_order)
            ->orderBy('order', 'asc')
            ->first();

        if (!$menu) {
            // If there is no next menu, display the first menu
            $menu = Menu::where('user_id', $user_id)
                ->orderBy('order', 'asc')
                ->first();
---
select * from `users` where `users`.`id` = 1 limit 1
select * from `menus` where `user_id` = 1 and `order` > 3 order by `order` asc limit 1
select * from `menus` where `user_id` = 1 order by `order` asc limit 1

    public function completeMenu(Request $request, $id)
    {
        $completed_exercises = $request->input('completed_exercises');
        if (!$completed_exercises) {
            return redirect()->route('today_menu', ['id' => $id])->with('error', '完了が選択されていません');
        }

        $menu = Menu::find($id);

        foreach ($completed_exercises as $completed_exercise) {
            $menuExercise = MenuExercise::find($completed_exercise);

            if (is_null($menuExercise->reps)) {
                return redirect()->route('today_menu', ['id' => $id])->with('error', '回数の情報がありません。');
            }

            if (is_null($menuExercise->weight)) {
                return redirect()->route('today_menu', ['id' => $id])->with('error', '重量の情報がありません。');
            }

            History::create([
                'user_id' => Auth::id(),
                'menu_id' => $menu->id,
                'exercise_id' => $menuExercise->exercise_id,
                'menu_exercise_id' => $completed_exercise,
                'exercise_date' => Carbon::now(),
                'menu_name' => $menu->name,
                'exercise_name' => $menuExercise->exercise->name,
                'sets' => $menuExercise->set,
                'weight' => $menuExercise->weight,
                'reps' => $menuExercise->reps,
                'memo' => '',
            ]);
---
select * from `menus` where `menus`.`id` = '7' limit 1
select * from `menu_exercises` where `menu_exercises`.`id` = '22' limit 1
insert into `histories` (`user_id`, `menu_id`, `exercise_id`, `menu_exercise_id`, `exercise_date`, `menu_name`, `exercise_name`, `sets`, `weight`, `reps`, `memo`, `updated_at`, `created_at`) values (1, 7, 5, '22', '2023-08-11 22:00:09', 'www', 'インクラインアームカール', 1, 123, 123, '', '2023-08-11 22:00:09', '2023-08-11 22:00:09')

    public function todayComplete($id)
    {
        // Update the last completed menu for the user
        $user = Auth::user();
        $menu = Menu::find($id);
        $user->last_completed_menu_id = $id;
        $user->last_finish_order = $menu->order;
        $user->save();

        // Find the next menu
        $nextMenu = Menu::where('user_id', Auth::id())
            ->where('order', '>', $menu->order)
            ->orderBy('order', 'asc')
            ->first();

        if ($nextMenu) {
            // If there is a next menu, redirect to it
            return redirect()->route('today_menu', ['id' => $nextMenu->id]);
        } else {
            // If there is no next menu, redirect to the first menu
            $firstMenu = Menu::where('user_id', Auth::id())
                ->orderBy('order', 'asc')
                ->first();
---
select * from `menus` where `menus`.`id` = '4' limit 1
update `users` set `last_completed_menu_id` = '4', `last_finish_order` = 3, `users`.`updated_at` = '2023-08-11 22:01:15' where `id` = 1
select * from `menus` where `user_id` = 1 and `order` > 3 order by `order` asc limit 1
select * from `menus` where `user_id` = 1 order by `order` asc limit 1

    public function todayEdit(string $id)
    {

        $menu = Menu::find($id);
        $exercises = Exercises::all()->groupBy('body_part');
---
select * from `menus` where `menus`.`id` = '7' limit 1
select * from `exercises`

    public function todayUpdate(TodayMenusRequest $request, string $id)
    {

        $menu = Menu::findOrFail($id);
---
select * from `menus` where `menus`.`id` = '7' limit 1

            function ($id) {
                return $id !== 'new';
            }
        );

        // データベースから現在のメニューに関連する全てのメニューエクササイズを取得し、それらが上記の配列に存在しない場合、それらを削除
        MenuExercise::where('menu_id', $id)->whereNotIn('id', $menuExerciseIds)->delete();

        // 以下は既存のコードを維持
        foreach ($request->menu_exercises as $menuExerciseData) {
            if (isset($menuExerciseData['id']) && $menuExerciseData['id'] != 'new') {
                // Existing menu exercise update
                $menuExercise = MenuExercise::find($menuExerciseData['id']);
---
delete from `menu_exercises` where `menu_id` = '7' and `id` not in ('28', '29')
select * from `menu_exercises` where `menu_exercises`.`id` = '28' limit 1

    public function todayDestroy(string $id)
    {
        // 送られてきた id から対応する MenuExercise を取得
        $menuExercise = MenuExercise::find($id);

        // 取得した MenuExercise の menu_id と exercise_id を取得
        $menu_id = $menuExercise->menu_id;
        $exercise_id = $menuExercise->exercise_id;

        // 同じ menu_id を持ち、同じ exercise_id を持つすべての MenuExercise を削除
        MenuExercise::where('menu_id', $menu_id)
            ->where('exercise_id', $exercise_id)
            ->delete();
---
select * from `menu_exercises` where `menu_exercises`.`id` = '17' limit 1
delete from `menu_exercises` where `menu_id` = 7 and `exercise_id` = 24

    public function addExercises(TodayMenusRequest $request) // 種目追加モーダルからの送信
    {
        $menuId = $request->input('menu_id');
        $menu = Menu::find($menuId);
        $existingExerciseIds = $menu->exercises->pluck('id')->toArray();
---
select * from `menus` where `menus`.`id` = '3' limit 1
select `exercises`.*, `menu_exercises`.`menu_id` as `pivot_menu_id`, `menu_exercises`.`exercise_id` as `pivot_exercise_id` from `exercises` inner join `menu_exercises` on `exercises`.`id` = `menu_exercises`.`exercise_id` where `menu_exercises`.`menu_id` = 3

                function ($attribute, $value, $fail) use ($existingExerciseIds) {
                    if (array_intersect($value, $existingExerciseIds)) {
                        $fail('既にメニューに登録されている種目が選択されています。');
                    }
                },
            ],
            // その他のバリデーションルール
        ]);

        if ($validator->fails()) {
            session()->flash('showModal', true);
            return redirect()->back()->withErrors($validator)->withInput();
        }

        // Get the request data
        $exerciseIds = $request->input('selectedExercises');
        $currentExercisesCount = $menu->exercises()->count();

        // Save the data
        foreach ($exerciseIds as $exerciseId) {
            $menu->exercises()->attach($exerciseId, ['set' => 1, 'index' => $currentExercisesCount]);
---
select count(*) as aggregate from `exercises` inner join `menu_exercises` on `exercises`.`id` = `menu_exercises`.`exercise_id` where `menu_exercises`.`menu_id` = 3
insert into `menu_exercises` (`exercise_id`, `index`, `menu_id`, `set`) values ('16', 6, 3, 1)